SM_для_EDT/src/Catalogs/рарусВидыМероприятийСУБ/рарусВидыМероприятийСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусВидыМероприятийСУБ</name>
  <attributes>
    <name>ТипМероприятия</name>
    <type>
      <types>EnumRef.рарусТипыМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектМероприятия</name>
    <type>
      <types>EnumRef.рарусВидыВладельцевДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОсвидетельствования</name>
    <type>
      <types>CatalogRef.рарусТипыОсвидетельствования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.рарусВидыДокументовОсвидетельствования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <types>CatalogRef.vftПодразделенияКомпании</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодическоеМероприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетРезультатВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОпроса</name>
    <type>
      <types>CatalogRef.ШаблоныАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролирующийОрган</name>
    <type>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерМероприятия</name>
    <type>
      <types>EnumRef.рарусХарактерМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяКодыЗамечанийИСроковУстранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Конвенция</name>
    <type>
      <types>CatalogRef.рарусКонвенции</types>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/рарусВидыМероприятийСУБ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ТипМероприятия");
	Результат.Добавить("Обозначение");
	Результат.Добавить("ОбъектМероприятия");
	Результат.Добавить("ТипОсвидетельствования");
	Результат.Добавить("ВидДокумента");
	Результат.Добавить("ВидМероприятия");
	Результат.Добавить("КонтролирующийОрган");
	Результат.Добавить("ПериодическоеМероприятие");
	Результат.Добавить("ИмеетРезультатВыполнения");
	Результат.Добавить("ШаблонОпроса");
	Результат.Добавить("Комментарий");
	Результат.Добавить("Периодичность");
	Результат.Добавить("ХарактерМероприятия");
	Результат.Добавить("Подразделение");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
